var mysql      = require('mysql');
var connection = mysql.createConnection({
  	host: '127.0.0.1',
  	user: 'root',
  	password: 'zsf0310',
  	database: 'AliPay',
  	port: '3306'
});
billData = [ { id: '20170605124625769791',
    bill: '  今天 07:51 余额宝-2017.06.04-收益发放 天弘基金管理有限公司 |  流水号 2017...791 + 0.06    交易成功 备注   ' },
  { id: '2017060421001004790296934568',
    bill: '  昨天 21:08 美团点评智能支付_东方宫兰州拉面（南法信店） 东方宫兰州拉面（南法信店） |  流水号 2017...568 - 20.00    交易成功  ' },
  { id: '20170604310500100010790009297843',
    bill: '  昨天 10:16 余额宝-单次转入 天弘基金管理有限公司 |  流水号 2017...843 2000.00    交易成功  ' },
  { id: '20170604123325126791',
    bill: '  昨天 08:09 余额宝-2017.06.03-收益发放 天弘基金管理有限公司 |  流水号 2017...791 + 0.06    交易成功 备注  ' },
  { id: '2017060321001004790295136414',
    bill: '  2017-06-03 20:29 世纪华联超市北京南法信店 世纪华联超市北京南法信店-6521100263-1680000173100 | 流水号 2017...414 - 57.19    交易成功  ' },
  { id: '20170603310500100010790009212645',
    bill: '  2017-06-03 17:36 余额宝-单次转入 天弘基金管理有限公司 |  流水号 2017...645 1716.00    交易成功  ' },
  { id: '20170603200040011100790026085183',
    bill: '  2017-06-03 15:19 收款 杏儿 |  流水号 2017...183 - 25.00     交易成功  ' },
  { id: '20170603686851267902',
    bill: '  2017-06-03 13:42 网商银行贷款-网商贷还款 浙江网商银行股份有限公司 |  流水号 2017...902 - 656.13    交易成功 备注  ' },
  { id: '20170603694274017902',
    bill: '  2017-06-03 13:42 网商银行贷款-网商贷还款 浙江网商银行股份有限公司 |  流水号 2017...902 - 214.10    交易成功 备注  ' },
  { id: '20170603200040011100790025801814',
    bill: '  2017-06-03 09:29 转账 张扬(张扬) |  流水号 2017...814 - 100.00     交易成功  ' },
  { id: '20170603121307805791',
    bill: '  2017-06-03 05:15 余额宝-2017.06.02-收益发放 天弘基金管理有限公司 |  流水号 2017...791 + 0.15    交易成功 备注  ' },
  { id: '2017060221001001790293506849',
    bill: '  2017-06-02 23:03 181-5942-6965 中国电信官方旗舰店 福建手机电信充值100元电信话费 直充快充 中国电信官方旗舰店 |  流水号 2017...849 - 99.80    交易成功  ' },
  { id: '20170602200040011100790025761607',
    bill: '  2017-06-02 23:01 转账到银行卡-转账 朱风美 |  流水号 2017...607 - 10.00    交易成功  ' },
  { id: '20170602200040011100790025751614',
    bill: '  2017-06-02 22:46 转账到银行卡-转账 朱风美 |  流水号 2017...614 - 3000.00    交易成功  ' },
  { id: '20170602200040011100820027022665',
    bill: '  2017-06-02 22:42 转账 橙橙橙橙橙橙橙 |  流水号 2017...665 + 3000.00     交易成功  ' },
  { id: '20170602200040011100790025734289',
    bill: '  2017-06-02 22:41 转账 橙橙橙橙橙橙橙(朱风美) |  流水号 2017...289 - 3000.00     交易成功  ' },
  { id: '2017060221001004790292233871',
    bill: '  2017-06-02 11:37 U味儿（亚运村毛毛家店）外卖订单 饿了么 |  流水号 2017...871 - 15.90    交易成功  ' },
  { id: '2017060221001004790291936148',
    bill: '  2017-06-02 09:10 北京一卡通充值 联动优势科技有限公司 |  流水号 2017...148 - 100.00    交易成功  ' } ];
// 


connection.connect(); 
for(var i =1;i<=billData.length;i++){
	console.log(i);
	(function(i){
		connection.query("INSERT INTO sofar(id,bill) VALUES ("+ billData[i-1].id +",'" + billData[i-1].bill + "');",function (err, rows) {
		    console.log(err);
		    // if(err.errno)
		    console.log(rows);
		    console.log("——————————")
		    
		});
	}(i))
}
// connection.end();
function query(sql, param,callback) {
	//创建一个connection
	connection.connect(); 
    connection.query(sql,param,function (err, rows) {
        callback(err, rows);
    });
    //关闭connection
			// connection.end();
}

// billData.forEach(function(v,i){
// 	setTimeout(function(){
// 		query('SELECT * FROM `billData` WHERE `id` = ?',[v.id], function(err,rows){
// 			if(err){
// 				console.log(err);
// 			}else{
// 				console.log(rows);
// 			}
			
// 		})
// 	},100*i)
	
// })
// "INSERT INTO billData(id,bill) VALUES (56,'hjbhkg');"
// query("INSERT INTO billData(id,bill) VALUES ?;", [values], function (err, rows, fields) {
//     if(err){
// 		console.log(err);
// 	}else{
// 		console.log(rows);
// 	}
// });